DataProcessors/РабочееМестоКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>РабочееМестоКазначея</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗаявкиНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРасходованиеСредств</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма к оплате</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.Сервис</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ГТДИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаспределенияПоПроектам</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПоПереработке</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
						<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.АктОбОказанииПроизводственныхУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаОтПокупателяПлатежнойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисныеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДенежныхСредств</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыРеестраНаОплатуДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыРеестраНаОплатуДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогалсовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/РабочееМестоКазначея/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
 
	 
 КонецПроцедуры
 
 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ГруппаОтбор.Скрыть();
	ЗаВесьПериод = Истина; 
	
	ЗаВесьПериодПриИзменении(Неопределено);
КонецПроцедуры


&НаСервере
Процедура ИнициализироватьКомпоновкуДанных(ВсегдаИспользоватьНастройкиПоУмолчанию)
	
	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗаполнения");
	
	URLСхемы = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор());
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(URLСхемы);
	
	КомпановщикНастроек.Инициализировать(ИсточникНастроек);
	
	КомпановщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
					
КонецПроцедуры
 

&НаКлиенте
Процедура Заполнить(Команда)
		ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ЗаявкиНаРасходованиеНаличные.Очистить();
	ЗаявкиНаРасходованиеБезналичные.Очистить();

	ИнициализироватьКомпоновкуДанных(Ложь);

	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Объект").ПолучитьМакет("СхемаЗаполнения");	
	
	Если ЗаВесьПериод Тогда   
		
			
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Дата(2000,1,1);
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Дата(2050,1,1);
		ЭД.Использование = Истина;

				
	Иначе 
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Период.ДатаНачала;
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Период.ДатаОкончания;
		ЭД.Использование = Истина;
	
		
	КонецЕсли;
	
	ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФормаОплаты");
	ЭД.Значение = Перечисления.ВидыДенежныхСредств.Безналичные;
	ЭД.Использование = Истина;

	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпановщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ = ЗаявкиНаРасходованиеБезналичные.Выгрузить();
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ЗаявкиНаРасходованиеБезналичные.Загрузить(ТЗ);	
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	КомпановщикНастроек = Неопределено;
	ИнициализироватьКомпоновкуДанных(Ложь);
	
	
	Если ЗаВесьПериод Тогда   
		
			
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Дата(2000,1,1);
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Дата(2050,1,1);
		ЭД.Использование = Истина;

				
	Иначе 
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
		ЭД.Значение = Период.ДатаНачала;
		ЭД.Использование = Истина;
		
		ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
		ЭД.Значение = Период.ДатаОкончания;
		ЭД.Использование = Истина;
	
		
	КонецЕсли;
	
	ЭД = КомпановщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФормаОплаты");
	ЭД.Значение = Перечисления.ВидыДенежныхСредств.Наличные;
	ЭД.Использование = Истина;


	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпановщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	//ТЗ = ЗаявкиНаРасходованиеНаличные.Выгрузить();
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

	ЗаявкиНаРасходованиеНаличные.Загрузить(ТЗ);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеДокументНажатие(Элемент, СтандартнаяОбработка)
	ПоказатьЗначение(,Элементы.ЗаявкиНаРасходованиеНаличные.ТекущиеДанные.Документ);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаРасходованиеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ЗаявкиНаРасходованиеДокумент" 
		или Поле.Имя = "ЗаявкиНаРасходованиеБезналичныеДокумент" Тогда 
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Документ);
	КонецЕсли;
	
	Если Поле.Имя = "ЗаявкиНаРасходованиеНомерРеестра"
		или Поле.Имя = "ЗаявкиНаРасходованиеБезналичныеНомерРеестра"Тогда 
		ПоказатьЗначение(,Элемент.ТекущиеДанные.Реестр);
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ЗаВесьПериодПриИзменении(Элемент)
	Если ЗаВесьПериод Тогда 
		Элементы.Период.Доступность = Ложь;
	Иначе
		Элементы.Период.Доступность = Истина;
	КонецЕсли; 
КонецПроцедуры


&НаКлиенте
Процедура СоздатьРеестрНаОплату(Команда)
	КонецПроцедуры

&НаСервере
Функция СоздатьРеестрНаОплатуНаСервере(ФормаОплаты) 
	
	Реестр        = Документы.РеестрПлатежей.СоздатьДокумент();
	Реестр.ФормаОплаты = ФормаОплаты;
	Реестр.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Реестр.Статус = Перечисления.СтатусыРеестраНаОплатуДС.Черновик;
	
	Если ФормаОплаты = Перечисления.ВидыДенежныхСредств.Наличные Тогда 
		Для Каждого Строка из ЗаявкиНаРасходованиеНаличные цикл
			Если Строка.использовать тогда 
				//Если не НайтиРеестр(строка.Документ) Тогда 
					Реестр.Дата                  = ТекущаяДата();
					СтрокаРеестра                = Реестр.ЗаявкиНаРасходованиеДС.Добавить();
					СтрокаРеестра.Заявка         = строка.Документ;
					СтрокаРеестра.СуммаДокумента = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СуммаКОплате   = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СтатьяДДС      = строка.Документ.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
					СтрокаРеестра.Проект         = строка.Документ.РасшифровкаПлатежа[0].Проект;
					Реестр.Записать();
					строка.НомерРеестра = Реестр.Номер; 
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Для Каждого Строка из ЗаявкиНаРасходованиеБезналичные цикл
			Если Строка.использовать тогда 
				//Если не НайтиРеестр(строка.Документ) Тогда 
					Реестр.Дата   		 		 = ТекущаяДата();
					СтрокаРеестра		 		 = Реестр.ЗаявкиНаРасходованиеДС.Добавить();
					СтрокаРеестра.Заявка 		 = строка.Документ;
					СтрокаРеестра.СуммаДокумента = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СуммаКОплате   = ПолучитьОстатокПоЗаявке(строка.Документ);
					СтрокаРеестра.СтатьяДДС      = строка.Документ.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
					СтрокаРеестра.Проект         = строка.Документ.РасшифровкаПлатежа[0].Проект;
					Реестр.Записать();
					строка.НомерРеестра = Реестр.Номер; 
				//КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Реестр.Ссылка;
	
КонецФункции

&НаСервере
Функция НайтиРеестр(Заявка)
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеестрПлатежейЗаявкиНаРасходованиеДС.Ссылка
	               |ИЗ
	               |	Документ.РеестрПлатежей.ЗаявкиНаРасходованиеДС КАК РеестрПлатежейЗаявкиНаРасходованиеДС
	               |ГДЕ
	               |	РеестрПлатежейЗаявкиНаРасходованиеДС.Заявка = &Заявка
	               |	И РеестрПлатежейЗаявкиНаРасходованиеДС.Ссылка.Проведен";
	Запрос.УстановитьПараметр("Заявка",Заявка);
	
	Возврат Запрос.Выполнить().Выгрузить().Количество();
КонецФункции

&НаКлиенте
Процедура ОбновитьСписокЗаявок(Результат, ДополнительныеПараметры) Экспорт 
	
	ЗаполнитьНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	Для Каждого Строка из ЗаявкиНаРасходованиеНаличные цикл
		Строка.использовать = истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого Строка из ЗаявкиНаРасходованиеНаличные цикл
		Строка.использовать = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеестрНаОплатуНаличные(Команда)
	Реестр = СоздатьРеестрНаОплатуНаСервере(Перечисления.ВидыДенежныхСредств.Наличные);	
	ПоказатьЗначение(Новый ОписаниеОповещения("ОбновитьСписокЗаявок",ЭтаФорма),Реестр);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРеестрНаОплатуБезналичные(Команда)
	Реестр = СоздатьРеестрНаОплатуНаСервере(Перечисления.ВидыДенежныхСредств.Безналичные);	
	ПоказатьЗначение(Новый ОписаниеОповещения("ОбновитьСписокЗаявок",ЭтаФорма),Реестр);
КонецПроцедуры

Функция ПолучитьОстатокПоЗаявке(Заявка)
	
	Запрос = новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДенежныеСредстваКВыплатеОстатки.СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки КАК ДенежныеСредстваКВыплатеОстатки
	               |ГДЕ
	               |	ДенежныеСредстваКВыплатеОстатки.ЗаявкаНаРасходование = &ЗаявкаНаРасходованиеДенежныхСредств";
	Запрос.УстановитьПараметр("ЗаявкаНаРасходованиеДенежныхСредств",Заявка);
	
	РезультатЗапрос = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапрос.Количество() Тогда 
		Возврат РезультатЗапрос[0].СуммаОстаток;
		
	КонецЕсли;
	Возврат 0;	
КонецФункции

&НаСервере
Процедура ОтправитьПисьмоНаСервере(ИмяТч)
	
	Если ИмяТч = "ЗаявкиБезнал" Тогда
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Использовать", Истина);
		стрПоиска.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		
		НайденныеСтроки = ЗаявкиНаРасходованиеБезналичные.НайтиСтроки(стрПоиска);
		
	ИначеЕсли ИмяТч = "ЗаявкиНал" Тогда	
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Использовать", Истина);
		стрПоиска.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		
		НайденныеСтроки = ЗаявкиНаРасходованиеНаличные.НайтиСтроки(стрПоиска);
		
	ИначеЕсли ИмяТч = "ЗаявкиРеестр" Тогда	
		
		стрПоиска = Новый Структура;
		стрПоиска.Вставить("Использовать", Истина);
		стрПоиска.Вставить("Статус", Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Согласована);
		
		НайденныеСтроки = ЗаявкиНаРасходованиеНаличные.НайтиСтроки(стрПоиска);
		
	КонецЕсли;
	
	ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
	ПутьСохранения = Неопределено;
	
	СоответсвиеОрганизацииИЗаявки = Новый Соответствие;
	
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		
		Если СоответсвиеОрганизацииИЗаявки[НайденнаяСтрока.Документ.Организация] = Неопределено Тогда
			МассЗаявок = Новый Массив;
			МассЗаявок.Добавить(НайденнаяСтрока.Документ);
			СоответсвиеОрганизацииИЗаявки.Вставить(НайденнаяСтрока.Документ.Организация, МассЗаявок);
		Иначе
			СоответсвиеОрганизацииИЗаявки[НайденнаяСтрока.Документ.Организация].Добавить(НайденнаяСтрока.Документ);
		КонецЕсли;

	КонецЦикла;
	
	УчЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень");
	Для Каждого ЗаявкиИОтправители из СоответсвиеОрганизацииИЗаявки Цикл
		
		СписокПолучателей = Новый СписокЗначений;
		ЗаполнитьПоОрганизации(СписокПолучателей, ЗаявкиИОтправители.Ключ);
		
		ТемаПисьма 	= "Заявки узгодженні";
		ТекстПисьма = "Список заявок: <br>" ;
		Для Каждого стрЗаявка из ЗаявкиИОтправители.Значение Цикл
			
			ТекстПисьма = ТекстПисьма + " №" + стрЗаявка.Номер + ". від " + Формат(стрЗаявка.Дата, "ДЛФ=В") + "; <br> " ;
			
		КонецЦикла;
		
		Если СписокПолучателей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрПисьма = Новый Структура;
		СтрПисьма.Вставить("ОтправленоФоном", Истина);
		СтрПисьма.Вставить("Тело", ТекстПисьма);
		СтрПисьма.Вставить("Тема", ТемаПисьма);
		СтрПисьма.Вставить("УчетнаяЗапись", УчЗапись);
		СтрПисьма.Вставить("Кому", СписокПолучателей);
		СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
		СтрПисьмо.Письмо.ОтправитьПисьмо(, ПользовательОтправкиПоПочте);
		
	КонецЦикла;
	
	Сообщить("Листи надіслано");

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоЗаявкиБезнал(Команда)	
	ОтправитьПисьмоНаСервере("ЗаявкиБезнал");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоЗаявкиНал(Команда)	
	ОтправитьПисьмоНаСервере("ЗаявкиНал");
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмоЗаявкиРеестр(Команда)	
	ОтправитьПисьмоНаСервере("ЗаявкиРеестр");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоОрганизации(СписокПолучателей, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОрганизациитчБухгалтера.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ Пользователи
		|ИЗ
		|	Справочник.Организации.тчБухгалтера КАК ОрганизациитчБухгалтера
		|ГДЕ
		|	ОрганизациитчБухгалтера.Ссылка = &Организация
		|	И ОрганизациитчБухгалтера.Активный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтактнаяИнформация.Представление КАК Email
		|ИЗ
		|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект В
		|			(ВЫБРАТЬ
		|				Пользователи.Пользователь
		|			ИЗ
		|				Пользователи КАК Пользователи)
		|	И КонтактнаяИнформация.Тип = &Тип
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.СлужебныйАдресЭлектроннойПочтыПользователя);
	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Рез.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПолучателей.Добавить(Выборка.Email);
	КонецЦикла;
	
КонецПроцедуры
